In [1]:
import pandas as pd

Create a dataframe using 1D List.

In [24]:
list = [1,2, 3, 4]
df = pd.DataFrame(list)
df

   0
0  1
1  2
2  3
3  4

Create a dataframe using 2D List

In [25]:
list = [[1,2], [3,4]]
df1 = pd.DataFrame(list)
df1

   0  1
0  1  2
1  3  4

Create a dataframe using dictionary

In [37]:
dict1 = {"roll_no": [1,2], "stu_name": ["John", "Doe"]}

df1 = pd.DataFrame(dict1)
df1

   roll_no stu_name
0        1     John
1        2      Doe

Create a dataframe using CSV file (usecols)

In [50]:
df_csv = pd.read_csv("/content/sample_data/california_housing_test.csv")
df_csv

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

Giving column names

In [26]:
df1.columns = ["A", "B"]
df1

   A  B
0  1  2
1  3  4

To add a new column in a dataframe

In [29]:
df1['dept'] = ['IT', 'CS']
df1

   roll_no stu_name dept
0        1     John   IT
1        2      Doe   CS

To add a new row in a dataframe

In [38]:
newRow = {"roll_no": 5, "stu_name": "Alice", "dept": "med"}
df1 = df1.append(newRow, ignore_index=True)
newRow = {"roll_no": 4, "stu_name": "Bob", "dept": "music"}
df1 = df1.append(newRow, ignore_index=True)
df1

   roll_no stu_name   dept
0        1     John    NaN
1        2      Doe    NaN
2        5    Alice    med
3        4      Bob  music

Sort the dataframe according to index

In [39]:
df1.sort_index(ascending=False) #Descending

   roll_no stu_name   dept
3        4      Bob  music
2        5    Alice    med
1        2      Doe    NaN
0        1     John    NaN

In [41]:
df1.sort_index() #Ascending

   roll_no stu_name   dept
0        1     John    NaN
1        2      Doe    NaN
2        5    Alice    med
3        4      Bob  music

Sort the dataframe according to a single column

In [42]:
df1.sort_values(by=["stu_name"])

   roll_no stu_name   dept
2        5    Alice    med
3        4      Bob  music
1        2      Doe    NaN
0        1     John    NaN

Sort the dataframe according to multiple columns (ascending/descending, inplace, ignore_index)

In [47]:
df1.sort_values(by=["stu_name", "roll_no"], inplace=True, ignore_index=True)
df1

   roll_no stu_name   dept
0        5    Alice    med
1        4      Bob  music
2        2      Doe    NaN
3        1     John    NaN

Extracting a particular column

In [51]:
df_csv.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [63]:
#loc

pd.DataFrame(df_csv.loc[:2, 'total_rooms'])

   total_rooms
0       3885.0
1       1510.0
2       3589.0

In [66]:
#iloc

pd.DataFrame(df_csv.iloc[:4, :])

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0

[4 rows x 9 columns]

df.describe()

In [67]:
df_csv.describe()

         longitude    latitude  ...  median_income  median_house_value
count  3000.000000  3000.00000  ...    3000.000000          3000.00000
mean   -119.589200    35.63539  ...       3.807272        205846.27500
std       1.994936     2.12967  ...       1.854512        113119.68747
min    -124.180000    32.56000  ...       0.499900         22500.00000
25%    -121.810000    33.93000  ...       2.544000        121200.00000
50%    -118.485000    34.27000  ...       3.487150        177650.00000
75%    -118.020000    37.69000  ...       4.656475        263975.00000
max    -114.490000    41.92000  ...      15.000100        500001.00000

[8 rows x 9 columns]

df.info

In [68]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           3000 non-null   float64
 1   latitude            3000 non-null   float64
 2   housing_median_age  3000 non-null   float64
 3   total_rooms         3000 non-null   float64
 4   total_bedrooms      3000 non-null   float64
 5   population          3000 non-null   float64
 6   households          3000 non-null   float64
 7   median_income       3000 non-null   float64
 8   median_house_value  3000 non-null   float64
dtypes: float64(9)
memory usage: 211.1 KB

df.columns

In [69]:
df_csv.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

df.head

In [70]:
df_csv.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

df.shape

In [71]:
df_csv.shape

(3000, 9)

df.set_index

In [72]:
df1

   roll_no stu_name   dept
0        5    Alice    med
1        4      Bob  music
2        2      Doe    NaN
3        1     John    NaN

In [73]:
df1.set_index(['roll_no'])

        stu_name   dept
roll_no
5          Alice    med
4            Bob  music
2            Doe    NaN
1           John    NaN

df.reset_index

In [75]:
df1.reset_index().set_index(['index'])

       roll_no stu_name   dept
index
0            5    Alice    med
1            4      Bob  music
2            2      Doe    NaN
3            1     John    NaN

df[‘column name’].value_counts

In [77]:
df1['stu_name'].value_counts

<bound method IndexOpsMixin.value_counts of 0    Alice
1      Bob
2      Doe
3     John
Name: stu_name, dtype: object>

df.dropna

In [78]:
df1.dropna()

   roll_no stu_name   dept
0        5    Alice    med
1        4      Bob  music

In [79]:
df1.isna()

   roll_no  stu_name   dept
0    False     False  False
1    False     False  False
2    False     False   True
3    False     False   True

df[‘column name’].fillna

In [83]:
df1.fillna('demo', inplace=True)
df1

   roll_no stu_name   dept
0        5    Alice    med
1        4      Bob  music
2        2      Doe   demo
3        1     John   demo

df.copy

In [87]:
pd.DataFrame(df1.copy())

   roll_no stu_name   dept
0        5    Alice    med
1        4      Bob  music
2        2      Doe   demo
3        1     John   demo

In [7]:
df.set_index('A')

   B
A
1  2
3  4

In [9]:
df['C'] = [4, 5]
df

   A  B  C
0  1  2  4
1  3  4  5

In [13]:
df.describe()

              A         B         C
count  2.000000  2.000000  2.000000
mean   2.000000  3.000000  4.500000
std    1.414214  1.414214  0.707107
min    1.000000  2.000000  4.000000
25%    1.500000  2.500000  4.250000
50%    2.000000  3.000000  4.500000
75%    2.500000  3.500000  4.750000
max    3.000000  4.000000  5.000000

In [12]:
df1.describe()

        roll_no
count  2.000000
mean   1.500000
std    0.707107
min    1.000000
25%    1.250000
50%    1.500000
75%    1.750000
max    2.000000

In [20]:
newRow = {"roll_no": 3, "stu_name": "Alice", "dept": "finance", "stream": "commerce"}
df1 = df1.append(newRow, ignore_index=True)
df1

   roll_no stu_name     dept    stream
0        1     John       IT      arts
1        2      Doe       CS   science
2        3    Alice  finance  commerce

In [23]:
df.sort_values(by=["roll_no", "stu_name"], ignore_index=False, ascending=[True, True])

KeyError: ignored